src/reqmsg.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tns="http://127.0.0.1:8090/ODS/wsdl" xmlns:s="http://127.0.0.1:8090/ODS">
   <soapenv:Header/>
   <soapenv:Body>
      <tns:ReqS30013001504>
         <!--Optional:-->
         <s:ReqSysHead>
				<s:SvcId>RspS300130015</s:SvcId>
				<s:SvcScn>04</s:SvcScn>
				<s:SvcSplrTxnCd>DepositTransDetail</s:SvcSplrTxnCd>
				<s:SvcCstTxnCd>?</s:SvcCstTxnCd>
				<s:MAC>?</s:MAC>
				<s:CnsmrSysId>?</s:CnsmrSysId>
				<s:TxnDt>?</s:TxnDt>
				<s:TxnTm>?</s:TxnTm>
				<s:AcgDt>?</s:AcgDt>
				<s:CnsmrSeqNo>?</s:CnsmrSeqNo>
				<s:TxnChnlTp>?</s:TxnChnlTp>
				<s:ChnlNo>?</s:ChnlNo>
				<s:TxnTmlId>?</s:TxnTmlId>
				<s:CnsmrSvrId>?</s:CnsmrSvrId>
				<s:OrigCnsmrSeqNo>?</s:OrigCnsmrSeqNo>
				<s:OrigCnsmrId>?</s:OrigCnsmrId>
				<s:OrigTmlId>?</s:OrigTmlId>
				<s:OrigCnsmrSvrId>?</s:OrigCnsmrSvrId>
				<s:UsrLng>?</s:UsrLng>
				<s:FileFlg>?</s:FileFlg>
			</s:ReqSysHead>
         <!--Optional:-->
         <s:ReqAppHead>
            <s:TxnTlrId>?</s:TxnTlrId>
				<s:OrgId>?</s:OrgId>
				<s:TlrPwsd>?</s:TlrPwsd>
				<s:TlrLvl>?</s:TlrLvl>
				<s:TlrTp>?</s:TlrTp>
				<s:AprvFlg>?</s:AprvFlg>
            <s:AprvTlrInf>
					<s:AprvTlrId>?</s:AprvTlrId>
					<s:AprvOrgId>?</s:AprvOrgId>
					<s:AprvTlrLvl>?</s:AprvTlrLvl>
					<s:AprvTlrTp>?</s:AprvTlrTp>
				</s:AprvTlrInf>
            <!--Optional:-->
            <s:AhrFlg>?</s:AhrFlg>
            <!--Optional:-->
            <s:AhrTlrInf>
					<s:AhrTlrId>2342</s:AhrTlrId>
					<s:AhrOrgId>?</s:AhrOrgId>
					<s:AhrTlrPswd>?</s:AhrTlrPswd>
					<s:AhrTlrLvl>?</s:AhrTlrLvl>
					<s:AhrTlrTp>8989</s:AhrTlrTp>
				</s:AhrTlrInf>
            <!--Optional:-->
            <s:ScndFlg>?</s:ScndFlg>
         </s:ReqAppHead>
         <!--Optional:-->
<s:ReqLocalHead>
				<s:IcSrNo>?</s:IcSrNo>
			</s:ReqLocalHead>
         <!--Optional:-->
        <s:Body>
				<s:AcctAcc>9876543210</s:AcctAcc>
				<s:StrDt>20150102</s:StrDt>
				<s:EndDt>20150115</s:EndDt>
				<s:PgBgn>2</s:PgBgn>
				<s:PgShwNum>30</s:PgShwNum>
			</s:Body>
      </tns:ReqS30013001504>
   </soapenv:Body>
</soapenv:Envelope>